[
    {
        "title": "Who is Robert Prevost, the new Pope Leo XIV?",
        "link": "https://www.bbc.com/news/articles/c0ln80lzk7ko",
        "published": "Thu, 08 May 2025 18:48:36 GMT",
        "summary": "After a conclave that lasted only three sessions and 24 hours, 133 cardinals have elected Robert Prevost, now known as Pope Leo XIV."
    },
    {
        "title": "India reports strikes on military bases, Pakistan denies any role",
        "link": "https://www.bbc.com/news/articles/cjrndypy3l4o",
        "published": "Thu, 08 May 2025 20:05:55 GMT",
        "summary": "India has accused Pakistan of attacking three military bases, a claim which has been denied by Islamabad."
    },
    {
        "title": "Indian air strikes - how will Pakistan respond? Four key questions",
        "link": "https://www.bbc.com/news/articles/cd020710v1ko",
        "published": "Wed, 07 May 2025 11:55:25 GMT",
        "summary": "Experts from India and Pakistan weigh in on what’s next -  and how this clash differs from past conflicts."
    },
    {
        "title": "Ukraine labels Russian ceasefire a farce after reports of hundreds of violations",
        "link": "https://www.bbc.com/news/articles/cn8zlyynjv4o",
        "published": "Thu, 08 May 2025 11:28:58 GMT",
        "summary": "A three-day truce was called by Vladimir Putin ahead of Russia's World War Two Victory Day celebrations."
    },
    {
        "title": "Israeli forces close UN-run schools in East Jerusalem",
        "link": "https://www.bbc.com/news/articles/cqxej00w3wno",
        "published": "Thu, 08 May 2025 15:22:48 GMT",
        "summary": "The action, which affects hundreds of Palestinian pupils, comes after an Israeli ban on Unrwa this year."
    },
    {
        "title": "Turkey moves to silence jailed Erdogan rival by blocking account on X",
        "link": "https://www.bbc.com/news/articles/cvgve4q99d5o",
        "published": "Thu, 08 May 2025 12:52:32 GMT",
        "summary": "Istanbul Mayor Ekrem Imamoglu has relied on social media to stay in touch with supporters from jail."
    },
    {
        "title": "Bill Gates plans to give away most of his fortune by 2045",
        "link": "https://www.bbc.com/news/articles/cx2e87lzqkdo",
        "published": "Thu, 08 May 2025 21:07:04 GMT",
        "summary": "Microsoft founder said he will speed up his charitable giving - and accused Elon Musk and Doge of \"killing children\" through aid cuts."
    },
    {
        "title": "Charity linked to Prince Harry admits human rights abuses in Congo park",
        "link": "https://www.bbc.com/news/articles/cq54dgv2p29o",
        "published": "Thu, 08 May 2025 17:38:51 GMT",
        "summary": "African Parks acknowledged its rangers committed human rights abuses in Congo-Brazzaville."
    },
    {
        "title": "Israel PM 'uncertain' over condition of three Gaza hostages",
        "link": "https://www.bbc.com/news/articles/cd0l5egy9k4o",
        "published": "Thu, 08 May 2025 10:47:24 GMT",
        "summary": "Benjamin Netanyahu said he knew \"with certainty\" that 21 hostages were alive but the status of \"three more\" were unclear."
    },
    {
        "title": "Shock as missing South African journalist's decomposed body found",
        "link": "https://www.bbc.com/news/articles/c5yx34qrqn0o",
        "published": "Thu, 08 May 2025 15:32:23 GMT",
        "summary": "Human remains, believed to be that of a journalist and his partner, have been found by police."
    },
    {
        "title": "Woman killed in axe attack at Warsaw university",
        "link": "https://www.bbc.com/news/articles/cx2w2898p1jo",
        "published": "Thu, 08 May 2025 07:31:04 GMT",
        "summary": "A 22-year-old man was arrested over the attack which also left a security guard severely injured."
    },
    {
        "title": "Smokey Robinson denies sexual assault allegations",
        "link": "https://www.bbc.com/news/articles/c3e5j8v227ko",
        "published": "Thu, 08 May 2025 08:06:28 GMT",
        "summary": "In a statement, the singer's lawyer says the abuse allegations are an attempt to \"extract money\"."
    },
    {
        "title": "Dozens of pro-Palestinian protesters arrested at Columbia University",
        "link": "https://www.bbc.com/news/articles/ce929l5z2ldo",
        "published": "Thu, 08 May 2025 12:28:16 GMT",
        "summary": "The university asked for police help after protesters occupied part of the main library on Wednesday."
    },
    {
        "title": "US cuts aid to Zambia over 'systematic' medicine theft",
        "link": "https://www.bbc.com/news/articles/c1e6pl6302zo",
        "published": "Thu, 08 May 2025 21:01:07 GMT",
        "summary": "Critical medicines affected by the $50m cuts include Malaria, HIV and TB drugs, the US embassy says."
    },
    {
        "title": "Men found guilty of violent murder of Aboriginal schoolboy",
        "link": "https://www.bbc.com/news/articles/ce9vzzxpdm7o",
        "published": "Thu, 08 May 2025 05:54:05 GMT",
        "summary": "Cassius Turvey was chased through bush and beaten with a metal pole, in a case which sparked national outrage."
    },
    {
        "title": "US judge blocks plan to deport migrants to Libya",
        "link": "https://www.bbc.com/news/articles/c5yry9y089eo",
        "published": "Thu, 08 May 2025 09:04:03 GMT",
        "summary": "The order comes after lawyers expressed alarm that the US was planning to deport migrants to the North African country \"immediately\"."
    },
    {
        "title": "Sotheby's halts Buddha jewels auction after India threat",
        "link": "https://www.bbc.com/news/articles/ce9299nln2ko",
        "published": "Thu, 08 May 2025 06:37:42 GMT",
        "summary": "The jewels are described as one of the most astonishing archaeological finds of the modern era."
    },
    {
        "title": "Denmark summons US ambassador over Greenland spying report",
        "link": "https://www.bbc.com/news/articles/c0eley5gy8wo",
        "published": "Wed, 07 May 2025 20:10:41 GMT",
        "summary": "US spy agencies have been told to step up espionage around Greenland, according to The Wall Street Journal."
    },
    {
        "title": "Israeli strikes on Gaza restaurant and market kill 33, health ministry says",
        "link": "https://www.bbc.com/news/articles/c3676r17gg4o",
        "published": "Wed, 07 May 2025 18:03:50 GMT",
        "summary": "The restaurant in Gaza City's Rimal neighbourhood had been recently been operating a community kitchen."
    },
    {
        "title": "Russia says 60,000 air passengers stranded after Ukrainian drone attacks",
        "link": "https://www.bbc.com/news/articles/c2dedjn3px3o",
        "published": "Wed, 07 May 2025 18:16:48 GMT",
        "summary": "Some 350 flights are affected in Moscow and other cities, as Russia claims shooting down 524 Ukrainian drones."
    },
    {
        "title": "Pope Francis backed him when he took on a president. Now he's voting in the conclave",
        "link": "https://www.bbc.com/news/articles/cg72l1g43vko",
        "published": "Wed, 07 May 2025 22:47:03 GMT",
        "summary": "\"Not even in my wildest imagination did I think this would happen,\" Cardinal David tells the BBC."
    },
    {
        "title": "'This will be the work of years': The medics identifying remains from Syria's mass graves",
        "link": "https://www.bbc.com/news/articles/cdxnxg379ylo",
        "published": "Wed, 07 May 2025 23:13:03 GMT",
        "summary": "More than 100,000 men, women and children were reportedly forcibly disappeared by Bashar al-Assad's regime."
    },
    {
        "title": "Is Ivory Coast's red card politics an own goal for democracy?",
        "link": "https://www.bbc.com/news/articles/cly8y1kglkpo",
        "published": "Thu, 08 May 2025 00:07:07 GMT",
        "summary": "Why ex-bank boss Tidjane Thiam has been barred from seeking the Ivorian presidency - and the potential fallout."
    },
    {
        "title": "How Peter Dutton's heartland lost him Australia's election",
        "link": "https://www.bbc.com/news/articles/ckgxg6x2vv4o",
        "published": "Wed, 07 May 2025 22:45:28 GMT",
        "summary": "It was the opposition leader's home state that delivered Labor its win, with the red wave taking out his own seat."
    },
    {
        "title": "The divides behind the scenes in the Vatican ahead of the conclave",
        "link": "https://www.bbc.com/news/articles/c2de9d8dky0o",
        "published": "Tue, 06 May 2025 23:46:59 GMT",
        "summary": "Pope Francis's efforts to shake up the workings of the Church should be built on by the next pope, according to some - but his critics are less convinced"
    },
    {
        "title": "Joe Biden on Trump: 'What president ever talks like that? That's not who we are'",
        "link": "https://www.bbc.com/news/articles/c89g491e8ewo",
        "published": "Wed, 07 May 2025 05:05:25 GMT",
        "summary": "Exclusive: The former president tells Nick Robinson his verdict on his successor's first 100 days and his \"grave concern\" for the future of the Atlantic Alliance"
    },
    {
        "title": "What we know about India's strikes on Pakistan and Pakistan-administered Kashmir",
        "link": "https://www.bbc.com/news/articles/cj6868pdpw4o",
        "published": "Wed, 07 May 2025 18:19:58 GMT",
        "summary": "India launched strikes in the early hours of Wednesday - two weeks after a deadly militant attack."
    },
    {
        "title": "Rosenberg: Russians remember WW2 with victory on their minds",
        "link": "https://www.bbc.com/news/articles/cx2y2d50plzo",
        "published": "Wed, 07 May 2025 04:33:35 GMT",
        "summary": "Russia is gearing up to celebrate the 80th anniversary of the end of World War Two in Europe."
    },
    {
        "title": "Watch Pope Leo XIV's first public address - in full",
        "link": "https://www.bbc.com/news/videos/c1kv38nk8w1o",
        "published": "Thu, 08 May 2025 18:21:04 GMT",
        "summary": "Speaking from the Vatican balcony just after being unveiled as the new pontiff, he paid tribute to his predecessor and called for unity."
    },
    {
        "title": "Watch: Moment white smoke billows, signalling a new pope's election",
        "link": "https://www.bbc.com/news/videos/cpvkyk2k3ymo",
        "published": "Thu, 08 May 2025 16:20:54 GMT",
        "summary": "American Robert Prevost was later announced as the new pope, and will be known as Pope Leo XIV."
    },
    {
        "title": "Watch: Moments past conclaves elected new popes",
        "link": "https://www.bbc.com/news/videos/cgm8rwn1wvno",
        "published": "Thu, 08 May 2025 10:00:05 GMT",
        "summary": "See the moments previous popes were elected by conclaves past, from 1939 to 2013."
    },
    {
        "title": "What do Canadians make of Carney's meeting with Trump?",
        "link": "https://www.bbc.com/news/videos/cj3x36zpg13o",
        "published": "Wed, 07 May 2025 21:22:47 GMT",
        "summary": "The prime minister reiterated that Canada \"is not for sale\" during Tuesday's meeting at the White House."
    },
    {
        "title": "Watch: Biden's first interview since leaving the White House",
        "link": "https://www.bbc.com/news/videos/cn8085j2jnno",
        "published": "Wed, 07 May 2025 04:58:17 GMT",
        "summary": "Former US President Joe Biden talks Trump, Russia and US-Europe relations with the BBC's Today programme."
    },
    {
        "title": "Pay day banking outages hit 1.2m people, banks reveal",
        "link": "https://www.bbc.com/news/articles/c7875w07l93o",
        "published": "Thu, 08 May 2025 15:47:05 GMT",
        "summary": "In a letters to MPs, four major banks have set out the extent of the disruption caused in February's outage."
    },
    {
        "title": "Wikipedia legally challenges 'flawed' online safety rules",
        "link": "https://www.bbc.com/news/articles/c62j2gr8866o",
        "published": "Thu, 08 May 2025 09:30:31 GMT",
        "summary": "It argues the regulations could threaten the privacy and safety of Wikipedia's volunteer contributors."
    },
    {
        "title": "Apple hits back at US judge's 'extraordinary' contempt order",
        "link": "https://www.bbc.com/news/articles/c3r8rg4w2v0o",
        "published": "Thu, 08 May 2025 15:45:10 GMT",
        "summary": "The legal battle - started by Epic Games - could determine the future of the highly lucrative App Store."
    },
    {
        "title": "Arizona man shot to death in road rage 'returns' to address his killer",
        "link": "https://www.bbc.com/news/articles/cq808px90wxo",
        "published": "Wed, 07 May 2025 22:27:48 GMT",
        "summary": "With the help of artificial intelligence, a man was 'brought back to life' at his killer's sentencing to deliver a victim's statement himself."
    },
    {
        "title": "iPhone maker announces plan to build Mitsubishi EVs",
        "link": "https://www.bbc.com/news/articles/cz7974l151po",
        "published": "Thu, 08 May 2025 01:51:00 GMT",
        "summary": "The Taiwan-made electric vehicle is expected to go on sale in Australia and New Zealand next year."
    },
    {
        "title": "Ofcom needs more powers to remove misleading posts, says watchdog",
        "link": "https://www.bbc.com/news/articles/c0jzj18w77yo",
        "published": "Wed, 07 May 2025 09:38:02 GMT",
        "summary": "It says the 2024 summer riots showed the regulator does not have the tools to stop the spread of viral misinformation."
    },
    {
        "title": "Maker of Pegasus spyware told to pay $167m for WhatsApp hack",
        "link": "https://www.bbc.com/news/articles/c77n76kzmz4o",
        "published": "Wed, 07 May 2025 10:26:35 GMT",
        "summary": "Journalists and activists say the software is used by authoritarian regimes to spy on them."
    },
    {
        "title": "Delivery delays and empty shelves at Co-op after cyber attack",
        "link": "https://www.bbc.com/news/articles/cze1eg3z307o",
        "published": "Tue, 06 May 2025 15:25:09 GMT",
        "summary": "The retailer says \"sustained malicious attempts by hackers\" is affecting its IT systems."
    },
    {
        "title": "OpenAI says non-profit will remain in control after backlash",
        "link": "https://www.bbc.com/news/articles/cwy603eg0w8o",
        "published": "Mon, 05 May 2025 23:08:41 GMT",
        "summary": "The move follows a bitter power struggle over the business."
    },
    {
        "title": "Beware phony IT calls after Co-op and M&S hacks, says UK cyber centre",
        "link": "https://www.bbc.com/news/articles/c4grn878712o",
        "published": "Mon, 05 May 2025 10:30:03 GMT",
        "summary": "The NCSC urges firms to check IT help desk \"password reset processes\" as hackers target retailers."
    },
    {
        "title": "The people refusing to use AI",
        "link": "https://www.bbc.com/news/articles/c15q5qzdjqxo",
        "published": "Mon, 05 May 2025 23:16:41 GMT",
        "summary": "Worried about the environment and the loss of skills, some people are resisting the rise of AI."
    },
    {
        "title": "Long-distance romance and closure from husband's death - your memories of Skype",
        "link": "https://www.bbc.com/news/articles/cp913ze3k9jo",
        "published": "Sun, 04 May 2025 03:18:58 GMT",
        "summary": "As Microsoft shuts it down, we’ve spoken to people whose lives were impacted by  the tools."
    },
    {
        "title": "Co-op cyber attack affects customer data, firm admits, after hackers contact BBC",
        "link": "https://www.bbc.com/news/articles/crkx3vy54nzo",
        "published": "Fri, 02 May 2025 21:08:24 GMT",
        "summary": "The firm previously said there was \"no evidence that customer data was compromised\"."
    },
    {
        "title": "Co-op gives away free pasta sauce and coffee by mistake",
        "link": "https://www.bbc.com/news/articles/c9856ge2742o",
        "published": "Fri, 02 May 2025 12:25:05 GMT",
        "summary": "The pricing error allowed some shoppers to get pasta sauce, coffee and cookies for free."
    },
    {
        "title": "Apple says most US-bound iPhones no longer made in China",
        "link": "https://www.bbc.com/news/articles/c86jx18y9e2o",
        "published": "Fri, 02 May 2025 06:29:46 GMT",
        "summary": "The technology giant says US tariffs will add around $900m to its costs this quarter."
    },
    {
        "title": "Harrods latest retailer to be hit by cyber attack",
        "link": "https://www.bbc.com/news/articles/c62x4zxe418o",
        "published": "Thu, 01 May 2025 19:47:35 GMT",
        "summary": "The firm told the BBC it had restricted internet access in its stores following an attempted cyber attack."
    },
    {
        "title": "Xbox prices hiked worldwide amid tariff uncertainty",
        "link": "https://www.bbc.com/news/articles/cze1zn9d9p4o",
        "published": "Thu, 01 May 2025 17:09:02 GMT",
        "summary": "The company has pointed to increasing game development costs and \"market conditions\"."
    },
    {
        "title": "Co-op cyber attack: Staff told to keep cameras on in meetings",
        "link": "https://www.bbc.com/news/articles/cg72k851dd8o",
        "published": "Thu, 01 May 2025 12:47:11 GMT",
        "summary": "Experts say the instruction suggests the company fears hackers could be lurking on calls."
    },
    {
        "title": "Tesla denies contacting headhunters to replace Musk",
        "link": "https://www.bbc.com/news/articles/cr4n94klqg9o",
        "published": "Thu, 01 May 2025 11:10:39 GMT",
        "summary": "The electric car firm says a report that it is hunting for a successor is \"absolutely false\"."
    },
    {
        "title": "Update that made ChatGPT 'dangerously' sycophantic pulled",
        "link": "https://www.bbc.com/news/articles/cn4jnwdvg9qo",
        "published": "Wed, 30 Apr 2025 10:48:33 GMT",
        "summary": "Users said the chatbot endorsed ideas including stopping medication and getting angry at strangers"
    },
    {
        "title": "Apple referred for possible criminal contempt investigation",
        "link": "https://www.bbc.com/news/articles/c62xv43xqq5o",
        "published": "Thu, 01 May 2025 01:54:35 GMT",
        "summary": "The tech giant had been ordered in 2021 to allow greater competition and open the App Store up to outside payment options."
    },
    {
        "title": "Meta warns of 'worse' experience for European users",
        "link": "https://www.bbc.com/news/articles/czd3mey1ej2o",
        "published": "Thu, 01 May 2025 11:53:52 GMT",
        "summary": "Meta said the negative impact could kick in as soon as the third quarter of this year."
    },
    {
        "title": "Robot vacuums 'could water plants or play with cat'",
        "link": "https://www.bbc.com/news/articles/c5yrzyzke8do",
        "published": "Tue, 29 Apr 2025 23:07:05 GMT",
        "summary": "Scientists, including researchers in Bath, have come up with 100 proposed uses for the robots."
    },
    {
        "title": "Why is the M&S cyber attack chaos taking so long to resolve?",
        "link": "https://www.bbc.com/news/articles/cz79547nywno",
        "published": "Wed, 30 Apr 2025 08:15:24 GMT",
        "summary": "The company not saying who carried out the attack - or when their systems will be restored - suggests it's serious."
    },
    {
        "title": "Some M&S stores left with empty shelves after cyber attack",
        "link": "https://www.bbc.com/news/articles/cy489zelvx2o",
        "published": "Wed, 30 Apr 2025 07:44:39 GMT",
        "summary": "The BBC understands food availability should be back to normal by the end of the week."
    },
    {
        "title": "M&S stops online orders and issues refunds after cyber attack",
        "link": "https://www.bbc.com/news/articles/cdxnkg7rln2o",
        "published": "Sat, 26 Apr 2025 08:42:17 GMT",
        "summary": "The firm has stopped taking orders on its website and apps, including for food and clothes."
    },
    {
        "title": "How Armenia is trying to build a Silicon Valley in the Caucasus",
        "link": "https://www.bbc.com/news/articles/c2ew48p13y0o",
        "published": "Sun, 27 Apr 2025 23:46:46 GMT",
        "summary": "The country is aiming to boost its technology sector by training children in tech from a young age."
    },
    {
        "title": "Overhaul algorithms and age checks or face fines, tech firms told",
        "link": "https://www.bbc.com/news/articles/c5yljn2vkn1o",
        "published": "Thu, 24 Apr 2025 11:20:59 GMT",
        "summary": "Websites will have to instate age checks and tighten up algorithm recommendations for young users."
    },
    {
        "title": "How can you keep your child safe online?",
        "link": "https://www.bbc.co.uk/news/technology-68225707",
        "published": "Thu, 24 Apr 2025 15:13:17 GMT",
        "summary": "Tech firms are being urged to do more to stop young people accessing unsuitable material."
    },
    {
        "title": "Trump crypto soars as president offers dinner to top holders",
        "link": "https://www.bbc.com/news/articles/ce8g2kpzx0go",
        "published": "Thu, 24 Apr 2025 04:55:23 GMT",
        "summary": "The meme coin's website says its 220 top investors will be invited to a gala event with the president."
    },
    {
        "title": "ChatGPT-maker wants to buy Google Chrome",
        "link": "https://www.bbc.com/news/articles/c1dr6neg766o",
        "published": "Wed, 23 Apr 2025 09:54:45 GMT",
        "summary": "An OpenAI executive told a US judge the company would be interested in buying the popular browser."
    },
    {
        "title": "WhatsApp defends 'optional' AI tool that cannot be turned off",
        "link": "https://www.bbc.com/news/articles/cd7vzw78gz9o",
        "published": "Wed, 23 Apr 2025 14:26:00 GMT",
        "summary": "While Meta says the AI chatbot is a \"good thing\", some users have shared their frustrations."
    },
    {
        "title": "Tech Life",
        "link": "https://www.bbc.co.uk/sounds/play/w3ct6znn",
        "published": "Tue, 06 May 2025 19:30:00 GMT",
        "summary": "One man describes his job as a moderator in Ghana. And we say goodbye to Skype."
    },
    {
        "title": "Tech Life",
        "link": "https://www.bbc.co.uk/sounds/play/w3ct6znm",
        "published": "Tue, 29 Apr 2025 19:30:00 GMT",
        "summary": "The space mission to better understand how forests affect climate change on Earth."
    },
    {
        "title": "Tech Life",
        "link": "https://www.bbc.co.uk/sounds/play/w3ct6znl",
        "published": "Tue, 22 Apr 2025 19:30:00 GMT",
        "summary": "Artificial intelligence is being used to unlock the mysteries of dolphin communication."
    },
    {
        "title": "Tech Life",
        "link": "https://www.bbc.co.uk/sounds/play/w3ct6znk",
        "published": "Tue, 15 Apr 2025 19:30:00 GMT",
        "summary": "What is AI discrimination, and can it be fixed ?"
    },
    {
        "title": "Tech Now",
        "link": "https://www.bbc.co.uk/iplayer/episode/m002b37k",
        "published": "Sat, 12 Apr 2025 01:00:00 GMT",
        "summary": "Could nuclear fusion supply endless clean energy?"
    },
    {
        "title": "Tech Life",
        "link": "https://www.bbc.co.uk/sounds/play/w3ct6znj",
        "published": "Tue, 08 Apr 2025 19:30:00 GMT",
        "summary": "How do you get close enough to study a gigantic mass of ice floating in cold waters ?"
    },
    {
        "title": "Tech Now",
        "link": "https://www.bbc.co.uk/iplayer/episode/m0029w34",
        "published": "Sat, 05 Apr 2025 01:00:00 GMT",
        "summary": "Marc Cieslak has the highlights from the Game Developer Conference in San Francisco."
    },
    {
        "title": "Business Daily",
        "link": "https://www.bbc.co.uk/sounds/play/w3ct6rrt",
        "published": "Thu, 03 Apr 2025 23:01:00 GMT",
        "summary": "It's one of the world's biggest companies - we get exclusive access to the Seattle HQ"
    },
    {
        "title": "Tech Life",
        "link": "https://www.bbc.co.uk/sounds/play/w3ct6znh",
        "published": "Tue, 01 Apr 2025 19:32:00 GMT",
        "summary": "UN agencies are worried about rising cases of satellite navigation signal interference."
    },
    {
        "title": "Tech Now",
        "link": "https://www.bbc.co.uk/iplayer/episode/m0029n24",
        "published": "Sat, 29 Mar 2025 01:00:00 GMT",
        "summary": "Can we clean up air travel? Adrienne Murray explores developments in electric flight."
    },
    {
        "title": "Tech Life",
        "link": "https://www.bbc.co.uk/sounds/play/w3ct6znn",
        "published": "Tue, 06 May 2025 19:30:00 GMT",
        "summary": "One man describes his job as a moderator in Ghana. And we say goodbye to Skype."
    },
    {
        "title": "Who should you trust for a weather forecast?",
        "link": "https://www.bbc.com/news/articles/cql6vgwyv4xo",
        "published": "Thu, 01 May 2025 23:01:26 GMT",
        "summary": "Weather influencers can provide useful local information but are also accused of exaggerating conditions."
    },
    {
        "title": "What is bug hunting and why is it changing?",
        "link": "https://www.bbc.com/news/articles/c99n8r38rdlo",
        "published": "Mon, 28 Apr 2025 23:06:23 GMT",
        "summary": "Bug hunters make money by funding flaws in software, but AI is changing the way they work."
    },
    {
        "title": "Finland's bid to win Europe's start-up crown",
        "link": "https://www.bbc.com/news/articles/cx28y8jj4lxo",
        "published": "Mon, 14 Apr 2025 23:01:05 GMT",
        "summary": "Helsinki wants to become a top European start-up hub, but can it challenge London and Stockholm?"
    },
    {
        "title": "A revolution is under way in India's trainer industry",
        "link": "https://www.bbc.com/news/articles/cm2nplgm2kpo",
        "published": "Tue, 08 Apr 2025 01:51:32 GMT",
        "summary": "India wants to boost the domestic trainer industry but will small domestic makers suffer?"
    },
    {
        "title": "What's next for social media?",
        "link": "https://www.bbc.com/news/articles/c3w1e3xd2glo",
        "published": "Fri, 28 Mar 2025 00:02:06 GMT",
        "summary": "Start-up social media firms are looking to capitalise on dissatisfaction with the social media giants."
    },
    {
        "title": "The slow but steady advance of driverless vehicles",
        "link": "https://www.bbc.com/news/articles/cly41yx9w88o",
        "published": "Fri, 21 Mar 2025 00:02:48 GMT",
        "summary": "Robo-taxi services and driverless trucks are gaining ground but progress is painstaking."
    },
    {
        "title": "Disasters spur investment in flood and fire risk tech",
        "link": "https://www.bbc.com/news/articles/cjd39klk2ppo",
        "published": "Tue, 18 Mar 2025 00:08:03 GMT",
        "summary": "Services that assess climate change risks are springing up for home buyers, insurers and lenders."
    },
    {
        "title": "Soviet-era spacecraft likely to crash back to Earth",
        "link": "https://www.bbc.com/news/articles/cy9vz28nyedo",
        "published": "Wed, 07 May 2025 23:02:23 GMT",
        "summary": "The spacecraft was meant to go to Venus but has been stuck in orbit for more than 50 years."
    },
    {
        "title": "Blow to clean energy drive as major windfarm ditched",
        "link": "https://www.bbc.com/news/articles/ce848g8l8vro",
        "published": "Wed, 07 May 2025 12:27:29 GMT",
        "summary": "In a blow to the government's clean energy ambitions, a company cancels a huge windfarm off Yorkshire."
    },
    {
        "title": "Science meets shape-throwing in 'Dance your PhD' contest",
        "link": "https://www.bbc.com/news/videos/c70zdwyp9zeo",
        "published": "Sat, 03 May 2025 01:22:40 GMT",
        "summary": "Could you explain \"insights into oral chemesthetic perception\" using dance moves?"
    },
    {
        "title": "Can this lynx born in a zoo learn to live in the wild?",
        "link": "https://www.bbc.com/news/articles/c8074ry1yr5o",
        "published": "Fri, 02 May 2025 10:02:04 GMT",
        "summary": "It has been moved to Germany's Black Forest in preparation for its release"
    },
    {
        "title": "Mosquitoes in Scotland as far north as Shetland",
        "link": "https://www.bbc.com/news/articles/clyq59r8x7ro",
        "published": "Thu, 01 May 2025 05:06:03 GMT",
        "summary": "The extent of Scotland's mosquito population is being understood thanks to a successful citizen science project."
    },
    {
        "title": "Sandeel fishing ban to remain in place",
        "link": "https://www.bbc.com/news/articles/ckgrwxxzxkjo",
        "published": "Fri, 02 May 2025 16:47:43 GMT",
        "summary": "Sandeels are a vital source of food for seabirds that live along the UK coastline."
    },
    {
        "title": "Endangered axolotl release raises hopes for rare amphibian",
        "link": "https://www.bbc.com/news/articles/cm2xr2jzelyo",
        "published": "Wed, 30 Apr 2025 18:00:08 GMT",
        "summary": "Study provides hope for future of the axolotl amphibian, pushed to the brink of extinction in Mexico."
    },
    {
        "title": "Area burned by UK wildfires in 2025 already at annual record",
        "link": "https://www.bbc.com/news/articles/c0m9gm3jwljo",
        "published": "Sat, 26 Apr 2025 23:07:39 GMT",
        "summary": "The prolonged dry, sunny weather in March and April created ideal conditions for wildfires to spread."
    },
    {
        "title": "Just Stop Oil was policed to extinction - now the movement has gone deeper underground",
        "link": "https://www.bbc.com/news/articles/cz6denxzweeo",
        "published": "Thu, 24 Apr 2025 23:06:26 GMT",
        "summary": "Climate activists may be going deeper underground."
    },
    {
        "title": "Mission to boldly grow food in space labs blasts off",
        "link": "https://www.bbc.com/news/articles/cp34wzql2xvo",
        "published": "Tue, 22 Apr 2025 00:58:53 GMT",
        "summary": "The mission will explore new ways of reducing the cost of feeding an astronaut."
    },
    {
        "title": "Canada's top candidates talk up fossil fuels as climate slips down agenda",
        "link": "https://www.bbc.com/news/articles/c87pev3jpyyo",
        "published": "Mon, 21 Apr 2025 23:16:49 GMT",
        "summary": "Amid tariff threats from the US, energy and economic security are key issues in Canada's federal election."
    },
    {
        "title": "Could an almighty eruption destroy a dreamy Greek island?",
        "link": "https://www.bbc.com/news/articles/cm25lz56rezo",
        "published": "Sun, 20 Apr 2025 23:59:02 GMT",
        "summary": "Scientists are investigating for the first time how dangerous the island's next big one could be."
    },
    {
        "title": "Project to suck carbon out of sea begins in UK",
        "link": "https://www.bbc.com/news/articles/cr788kljlklo",
        "published": "Fri, 18 Apr 2025 00:20:52 GMT",
        "summary": "A pilot project will test whether it is a useful way of fighting climate change."
    },
    {
        "title": "England water pollution at 10-year high, campaigners say",
        "link": "https://www.bbc.com/news/articles/cy5rp6e75q4o",
        "published": "Wed, 16 Apr 2025 03:24:16 GMT",
        "summary": "Campaigners release official data showing the most serious pollution incidents in England are double the target."
    },
    {
        "title": "Colossal squid filmed in ocean for the first time",
        "link": "https://www.bbc.com/news/articles/c99pg13yv32o",
        "published": "Wed, 16 Apr 2025 13:15:00 GMT",
        "summary": "Stunned scientists say the extremely rare squid can weigh up to 500kg (1,100lb)."
    },
    {
        "title": "UK's rarest wildlife being 'pushed to extinction' by grass fires",
        "link": "https://www.bbc.com/news/articles/c2dej3x9432o",
        "published": "Wed, 16 Apr 2025 08:32:29 GMT",
        "summary": "Wildfires 'could spell the end' for rare species such as water voles and hen harriers."
    },
    {
        "title": "Blue Origin crew safely back on Earth after all-female space flight",
        "link": "https://www.bbc.com/news/articles/cvg8e5gq8ljo",
        "published": "Mon, 14 Apr 2025 21:45:05 GMT",
        "summary": "Six women - including pop star Katy Perry - blasted off into space as part of an all-women suborbital mission"
    },
    {
        "title": "Iraq sandstorm leaves many with breathing problems",
        "link": "https://www.bbc.com/news/articles/c0kxznxyx5do",
        "published": "Tue, 15 Apr 2025 02:58:26 GMT",
        "summary": "The sandstorm blanketed southern regions in an eerie, orange haze and shut down airports."
    },
    {
        "title": "Couple arrested for breeding exotic cats in Spain",
        "link": "https://www.bbc.com/news/articles/ce8g7m54gkro",
        "published": "Mon, 14 Apr 2025 22:23:28 GMT",
        "summary": "The couple is suspected of selling exotic cats online, including protected species such as white tigers."
    },
    {
        "title": "Starlings disappearing from gardens, says RSPB",
        "link": "https://www.bbc.com/news/articles/c1drrlp6dvzo",
        "published": "Fri, 11 Apr 2025 08:57:28 GMT",
        "summary": "The Big Garden Birdwatch survey recorded the lowest ever numbers of starlings this year."
    },
    {
        "title": "Titanic scan reveals ground-breaking details of ship's final hours",
        "link": "https://www.bbc.com/news/articles/cwy6gjwd0g6o",
        "published": "Tue, 08 Apr 2025 12:00:32 GMT",
        "summary": "The 3D replica corroborates eye witness accounts about what happened after the liner hit an iceberg."
    },
    {
        "title": "Experts dispute claim dire wolf brought back from extinction",
        "link": "https://www.bbc.com/news/articles/c4g9ejy3gdvo",
        "published": "Tue, 08 Apr 2025 11:20:52 GMT",
        "summary": "Independent experts say three white wolf puppies are not dire wolves, as claimed by US company Colossal"
    },
    {
        "title": "Record number of illegal sewage spills in Windermere last year",
        "link": "https://www.bbc.com/news/articles/cvg19q7pjdeo",
        "published": "Mon, 31 Mar 2025 05:02:29 GMT",
        "summary": "Campaigners identified 140 illegal spill days into the beauty spot in 2024"
    },
    {
        "title": "The Swedish city fined for missing an environmental target",
        "link": "https://www.bbc.com/news/articles/c5yx1rl8dk2o",
        "published": "Mon, 31 Mar 2025 01:39:10 GMT",
        "summary": "Gothenburg has to pay a financial penalty if it misses certain annual sustainability goals."
    },
    {
        "title": "Has Just Stop Oil really stopped throwing soup?",
        "link": "https://www.bbc.com/news/articles/cy0d047810no",
        "published": "Sat, 29 Mar 2025 10:56:23 GMT",
        "summary": "Just Stop Oil says it will disband but does this mark an end to the chaos caused by its climate protests?"
    },
    {
        "title": "Unique two-clawed dinosaur discovered",
        "link": "https://www.bbc.com/news/articles/cn7v3eln56no",
        "published": "Tue, 25 Mar 2025 15:26:27 GMT",
        "summary": "Duonychus is one of the few species of theropod dinosaur that evolved two-fingered hands."
    },
    {
        "title": "The truth about life on other planets - and what it means for humans",
        "link": "https://www.bbc.com/news/articles/cp8jwj90ejno",
        "published": "Thu, 17 Apr 2025 00:11:47 GMT",
        "summary": "Could discoveries of alien life ever change the human psyche in how we view ourselves and each other?"
    },
    {
        "title": "Astronauts Butch and Suni finally back on Earth",
        "link": "https://www.bbc.com/news/articles/c0mw221z2yyo",
        "published": "Wed, 19 Mar 2025 00:14:48 GMT",
        "summary": "Dolphins circled their capsule after it landed off the coast of Florida."
    },
    {
        "title": "Why scientists are counting tiny marine creatures, from Space",
        "link": "https://www.bbc.com/news/articles/c20g41845jdo",
        "published": "Tue, 04 Feb 2025 01:59:32 GMT",
        "summary": "Differences in seawater colour could reveal how tiny Antarctic creatures are faring in a warming world."
    },
    {
        "title": "Asteroid contains building blocks of life, say scientists",
        "link": "https://www.bbc.com/news/articles/c7vd1zjlr5lo",
        "published": "Wed, 29 Jan 2025 16:07:12 GMT",
        "summary": "Bennu contains minerals and thousands of organic molecules, including the chemical components that make up DNA."
    },
    {
        "title": "SpaceX Starship test fails after Texas launch",
        "link": "https://www.bbc.com/news/articles/cwy77x09y0po",
        "published": "Fri, 17 Jan 2025 02:27:56 GMT",
        "summary": "Officials at Elon Musk's company said the upper stage was lost, minutes after it launched."
    },
    {
        "title": "Rocket launch challenges Elon Musk's space dominance",
        "link": "https://www.bbc.com/news/articles/cx24eg7z7zgo",
        "published": "Thu, 16 Jan 2025 08:12:27 GMT",
        "summary": "Amazon founder Jeff Bezos's space company blasts its first rocket into orbit in a challenge to Elon Musk."
    },
    {
        "title": "Future of space travel: Could robots really replace human astronauts?",
        "link": "https://www.bbc.com/news/articles/cy7keddnj31o",
        "published": "Tue, 31 Dec 2024 01:46:51 GMT",
        "summary": "Advances in technology raise questions about the need to send people to space - and the risks and cost"
    },
    {
        "title": "New study on moons of Uranus raises chance of life",
        "link": "https://www.bbc.com/news/articles/cgk1333k0ypo",
        "published": "Mon, 11 Nov 2024 16:00:05 GMT",
        "summary": "The planet Uranus and its five biggest moons may not be the sterile worlds scientists have long thought."
    },
    {
        "title": "Blow to clean energy drive as major windfarm ditched",
        "link": "https://www.bbc.com/news/articles/ce848g8l8vro",
        "published": "Wed, 07 May 2025 12:27:29 GMT",
        "summary": "In a blow to the government's clean energy ambitions, a company cancels a huge windfarm off Yorkshire."
    },
    {
        "title": "Attenborough at 99 delivers 'greatest message he's ever told'",
        "link": "https://www.bbc.com/news/articles/cn0wjxg0ex1o",
        "published": "Tue, 06 May 2025 20:13:28 GMT",
        "summary": "Sir David says his new film Ocean is one of the most important of his career."
    },
    {
        "title": "How the political consensus on climate change has shattered",
        "link": "https://www.bbc.com/news/articles/cx20znjejw1o",
        "published": "Fri, 02 May 2025 14:16:59 GMT",
        "summary": "In 2019, the UK committed in law to reducing its carbon emissions to net zero by 2050. Now the political climate has changed."
    },
    {
        "title": "Government not taking climate seriously - advisers",
        "link": "https://www.bbc.com/news/articles/cvgpey03pnno",
        "published": "Wed, 30 Apr 2025 00:54:01 GMT",
        "summary": "The government has made little progress in preparing the UK for rising temperatures, climate watchdog the CCC says."
    },
    {
        "title": "The satellite that will 'weigh' world's 1.5 trillion trees",
        "link": "https://www.bbc.com/news/articles/crldwjj6d6no",
        "published": "Tue, 29 Apr 2025 10:27:52 GMT",
        "summary": "The new satellite will be able to see through clouds and forest canopies."
    },
    {
        "title": "Just Stop Oil was policed to extinction - now the movement has gone deeper underground",
        "link": "https://www.bbc.com/news/articles/cz6denxzweeo",
        "published": "Thu, 24 Apr 2025 23:06:26 GMT",
        "summary": "Climate activists may be going deeper underground."
    },
    {
        "title": "Miliband urges global cooperation amid energy 'challenges'",
        "link": "https://www.bbc.com/news/articles/cp8kr8k28z2o",
        "published": "Thu, 24 Apr 2025 10:50:30 GMT",
        "summary": "The UK Energy Secretary was speaking at the opening of a two day summit on energy security."
    },
    {
        "title": "Mystery of medieval cemetery near airport runway deepens",
        "link": "https://www.bbc.com/news/articles/c241e3jr7qlo",
        "published": "Wed, 23 Apr 2025 00:15:18 GMT",
        "summary": "Skeletons and artefacts unearthed from the site near Cardiff Airport are baffling archaeologists."
    },
    {
        "title": "Titanic scan reveals ground-breaking details of ship's final hours",
        "link": "https://www.bbc.com/news/articles/cwy6gjwd0g6o",
        "published": "Tue, 08 Apr 2025 12:00:32 GMT",
        "summary": "The 3D replica corroborates eye witness accounts about what happened after the liner hit an iceberg."
    },
    {
        "title": "What in the World",
        "link": "https://www.bbc.co.uk/sounds/play/w3ct681s",
        "published": "Wed, 19 Mar 2025 14:30:00 GMT",
        "summary": "And did they have enough underwear?"
    },
    {
        "title": "Astronauts Butch and Suni begin journey home after nine months in space",
        "link": "https://www.bbc.com/news/articles/cg4k0d55q24o",
        "published": "Tue, 18 Mar 2025 06:07:59 GMT",
        "summary": "The Nasa astronauts prepare to head to Earth after an eight-day mission turned into nine months."
    },
    {
        "title": "London Uncovered",
        "link": "https://www.bbc.co.uk/sounds/play/p0kqyy9v",
        "published": "Thu, 13 Feb 2025 10:41:02 GMT",
        "summary": "The BBC's Science Editor visits the site of a major archaeological discovery in the city."
    },
    {
        "title": "Just Stop Oil was policed to extinction - now the movement has gone deeper underground",
        "link": "https://www.bbc.com/news/articles/cz6denxzweeo",
        "published": "Thu, 24 Apr 2025 23:06:26 GMT",
        "summary": "Climate activists may be going deeper underground."
    },
    {
        "title": "The truth about life on other planets - and what it means for humans",
        "link": "https://www.bbc.com/news/articles/cp8jwj90ejno",
        "published": "Thu, 17 Apr 2025 00:11:47 GMT",
        "summary": "Could discoveries of alien life ever change the human psyche in how we view ourselves and each other?"
    },
    {
        "title": "The unexpected knock-on effect of Trump's minerals 'deal of the century'",
        "link": "https://www.bbc.com/news/articles/c30mjedjzgpo",
        "published": "Fri, 14 Mar 2025 01:26:54 GMT",
        "summary": "The president once derided attempts to develop new green technology as a \"green new scam\" - but his deal could help boost the US's potential in the sector"
    },
    {
        "title": "Planes are having their GPS hacked. Could new clocks keep them safe?",
        "link": "https://www.bbc.com/news/articles/cq6yg204pvmo",
        "published": "Mon, 03 Mar 2025 00:39:34 GMT",
        "summary": "How a new atomic clock might be the way to tackle attacks on plane GPS systems"
    },
    {
        "title": "Nasa needs saving from itself – but is this billionaire right for that job?",
        "link": "https://www.bbc.com/news/articles/cn93797z2dpo",
        "published": "Sun, 02 Feb 2025 00:04:19 GMT",
        "summary": "The success of SpaceX and other private-sector space firms is throwing up hard questions about America's \"great national treasure\"."
    },
    {
        "title": "BBC Inside Science",
        "link": "https://www.bbc.co.uk/sounds/play/m002bt8r",
        "published": "Thu, 08 May 2025 16:00:00 GMT",
        "summary": "A new study says 99.999% of the world’s deep seafloor is still unseen by humans."
    },
    {
        "title": "BBC Inside Science",
        "link": "https://www.bbc.co.uk/sounds/play/m002bj79",
        "published": "Thu, 01 May 2025 16:00:00 GMT",
        "summary": "Massive power cuts brought parts of Spain, Portugal and France to a standstill this week."
    },
    {
        "title": "BBC Inside Science",
        "link": "https://www.bbc.co.uk/sounds/play/m002b71y",
        "published": "Thu, 24 Apr 2025 18:00:00 GMT",
        "summary": "Reaction to White House proposals to cut funding for Nasa and a future asteroid fly past"
    },
    {
        "title": "BBC Inside Science",
        "link": "https://www.bbc.co.uk/sounds/play/m0029znq",
        "published": "Thu, 17 Apr 2025 16:00:00 GMT",
        "summary": "Translating noisy geese to time travel across the universe."
    }
]